**Python**

-   variables - storing data
-   data types - int float string - string list dictionary sets range
-   functions - create resuable code, lots of lines of code in one place
-   classes - help us containerise code, box things up,

**Libraries**

-   numpy - arrays we can create matrices, numerical calculation
-   pandas - DataFrames store data like spread sheets, excel sheets, we can manipulate those tables.

**Machine Learning**

-   data - clean data, analyse data, play with data
-   feed to the machine
-   show the machine what is right, what is wrong (learns, creates its own patterns)
-   then you ask questions, and get answers

**Dictionaries???**

-   we will try to create a dictionary
-   data types with keys and values

In [4]:
# create a small dictionary
# names of 4 students, and their marks

# key : value 

students = {
    "Idrees": 95,
    "Mel": 96,
    "Ibrahim":98,
    "Arief":100
}

print(students)

# access elements
students["Ibrahim"]

{'Idrees': 95, 'Mel': 96, 'Ibrahim': 98, 'Arief': 100}

98

In [5]:
students_grades = {
    "name": ["Idrees","Mel","Ibrahim","Hazira","Amin","Nazri"],
    "maths":[90,90,90,92,94,94],
    "english": [90,90,90,92,94,94],
    "science": [90,90,90,92,94,94]
}

print(students_grades)

{'name': ['Idrees', 'Mel', 'Ibrahim', 'Hazira', 'Amin', 'Nazri'], 'maths': [90, 90, 90, 92, 94, 94], 'english': [90, 90, 90, 92, 94, 94], 'science': [90, 90, 90, 92, 94, 94]}

In [6]:
students_grades["name"]

students_grades["name"][1]

'Mel'

In [7]:
# kalau nak tukar nama
students_grades["name"][1] = "Hannah"
students_grades["name"][1]

print(students_grades)

{'name': ['Idrees', 'Hannah', 'Ibrahim', 'Hazira', 'Amin', 'Nazri'], 'maths': [90, 90, 90, 92, 94, 94], 'english': [90, 90, 90, 92, 94, 94], 'science': [90, 90, 90, 92, 94, 94]}

In [8]:
pip install pandas

Requirement already satisfied: pandas in c:\users\arief\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\arief\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\arief\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\arief\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\arief\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\arief\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [9]:
import pandas as pd

df = pd.DataFrame(students_grades)
df

print("\n First table ---------\n",df)
print("\n second table --------\n",df)
print("\n third table --------\n",df)

 First table ---------
       name  maths  english  science
0   Idrees     90       90       90
1   Hannah     90       90       90
2  Ibrahim     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

 second table --------
       name  maths  english  science
0   Idrees     90       90       90
1   Hannah     90       90       90
2  Ibrahim     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

 third table --------
       name  maths  english  science
0   Idrees     90       90       90
1   Hannah     90       90       90
2  Ibrahim     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [10]:
type(df)

# numpy.ndarraytype(df)

pandas.core.frame.DataFrame

In [11]:
df.head(2) # top part of a df # 5 is the default argument
df.tail(2) # 2 dari bawah

    name  maths  english  science
4   Amin     94       94       94
5  Nazri     94       94       94

In [12]:
# we can acces certain columns in dataframes too

print("\n Names column ------------\n",df["name"])
print("\n maths column ------------\n",df["maths"])

print("\n maths column ------------\n",df["maths"])

df["maths"][5]

 Names column ------------
 0     Idrees
1     Hannah
2    Ibrahim
3     Hazira
4       Amin
5      Nazri
Name: name, dtype: object

 maths column ------------
 0    90
1    90
2    90
3    92
4    94
5    94
Name: maths, dtype: int64

 maths column ------------
 0    90
1    90
2    90
3    92
4    94
5    94
Name: maths, dtype: int64

np.int64(94)

In [13]:
import numpy as np
arrayyyy = np.array([])
type(arrayyyy)

numpy.ndarray

In [14]:
# series

marks_series = pd.Series([1,2,3,4,5], name= "maths")
# type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
Name: maths, dtype: int64

In [15]:
df

      name  maths  english  science
0   Idrees     90       90       90
1   Hannah     90       90       90
2  Ibrahim     90       90       90
3   Hazira     92       92       92
4     Amin     94       94       94
5    Nazri     94       94       94

In [16]:
# how many marks that Amin in English

english_amin =  df["english"][3]
print("Amin marks is:\t",english_amin)



hannah = df["name"][1]
marks = df["english"][1]
print(f"In English {hannah} had {marks} marks")

haz = df["name"][3]
haz_maths = df["maths"][3]

print(f" In Maths {haz} had {haz_maths} marks")

Amin marks is:	 92
In English Hannah had 90 marks
 In Maths Hazira had 92 marks

In [17]:
type(english_amin)

numpy.int64

In [18]:
# core data types we use in pandas?

# dataframe 
# series

In [19]:
# EXERCISE
# Create a series of data pd.series 5 values of temperature
# Create a Dataframe city and temperature - 5 cities

temp = {
    "City": ["Seremban","Shah Alam","Johor Bahru","Kuantan","Kuching"],
    "temperature": [30,33,32,34,36]
}

print(temp)

{'City': ['Seremban', 'Shah Alam', 'Johor Bahru', 'Kuantan', 'Kuching'], 'temperature': [30, 33, 32, 34, 36]}

In [20]:
import pandas as pd
Temp = pd.DataFrame(temp)
Temp

          City  temperature
0     Seremban           30
1    Shah Alam           33
2  Johor Bahru           32
3      Kuantan           34
4      Kuching           36

In [21]:
#jawapan sebenar
## Create a series of data pd.series 5 values of temperature

temp11 = pd.Series([32,31,50,34,-2])
print("type of temp11: ",type(temp11))

# a dictionary of temperatures
# python data object
temperatures = {
    "cities" : ["KL","HK","SG","NY","HLS"],
    "temperature" : [23,29,40,0,5]
}

# creating a dataframe
# dataframe is a pandas 
temp_df = pd.DataFrame(temperatures)
print("type of temp_df: ",type(temp_df))

print(temp_df)
print(temp11)


# temp_df ----> add day11 to this as well

type of temp11:  <class 'pandas.core.series.Series'>
type of temp_df:  <class 'pandas.core.frame.DataFrame'>
  cities  temperature
0     KL           23
1     HK           29
2     SG           40
3     NY            0
4    HLS            5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [23]:
type(temp_df["cities"])

pandas.core.series.Series

In [22]:
print(temp_df) # dataframe object
print(temp11)  # series object

  cities  temperature
0     KL           23
1     HK           29
2     SG           40
3     NY            0
4    HLS            5
0    32
1    31
2    50
3    34
4    -2
dtype: int64

In [26]:
# dataframe creates a column that does not exist
# dataframe bole tambah column
temp_df["new temp"] = temp11
temp_df

  cities  temperature  new temp
0     KL           23        32
1     HK           29        31
2     SG           40        50
3     NY            0        34
4    HLS            5        -2

In [27]:
temp_df ["temp11"] = {}
temp_df

  cities  temperature  new temp temp11
0     KL           23        32    NaN
1     HK           29        31    NaN
2     SG           40        50    NaN
3     NY            0        34    NaN
4    HLS            5        -2    NaN

In [28]:
temp_df ["idrees"] ={}
temp_df

  cities  temperature  new temp temp11 idrees
0     KL           23        32    NaN    NaN
1     HK           29        31    NaN    NaN
2     SG           40        50    NaN    NaN
3     NY            0        34    NaN    NaN
4    HLS            5        -2    NaN    NaN

In [29]:
temp_df ["mel"] = {}
temp_df

  cities  temperature  new temp temp11 idrees  mel
0     KL           23        32    NaN    NaN  NaN
1     HK           29        31    NaN    NaN  NaN
2     SG           40        50    NaN    NaN  NaN
3     NY            0        34    NaN    NaN  NaN
4    HLS            5        -2    NaN    NaN  NaN

In [30]:
temp_df ["ibrahim"] = {}
temp_df

  cities  temperature  new temp temp11 idrees  mel ibrahim
0     KL           23        32    NaN    NaN  NaN     NaN
1     HK           29        31    NaN    NaN  NaN     NaN
2     SG           40        50    NaN    NaN  NaN     NaN
3     NY            0        34    NaN    NaN  NaN     NaN
4    HLS            5        -2    NaN    NaN  NaN     NaN

In [32]:
temp_df ["idrees"] = pd.Series([3,2,1,4,5])

temp_df ["mel"] = pd.Series([2,9,8,7,6])

temp_df ["ibrahim"] = pd.Series([7,6,5,1,2])

In [33]:
temp_df

  cities  temperature  new temp temp11  idrees  mel  ibrahim
0     KL           23        32    NaN       3    2        7
1     HK           29        31    NaN       2    9        6
2     SG           40        50    NaN       1    8        5
3     NY            0        34    NaN       4    7        1
4    HLS            5        -2    NaN       5    6        2

In [34]:
# already a dataset?

# save this as a csv file??

temp_df.to_csv("City Rating without Row Numbers.csv", index=False)

In [35]:
data = {
    "cities" : ["KL","KL","KL","NY","HLS"],
    "temp10" : [23,29,40,0,5]
}

df = pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [36]:
df["cities"].value_counts()

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [37]:
df["cities"].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [38]:
df["cities"].duplicated()

0    False
1     True
2     True
3    False
4    False
Name: cities, dtype: bool

In [39]:
df2 = df["cities"].drop_duplicates()
df2

0     KL
3     NY
4    HLS
Name: cities, dtype: object